Repository: fat115/areas
Catalog: locale/*.po
Languages: ru

source: Protect your own area
ru: Защитить свою область

source: Invalid usage, see /help protect.
ru: Неверное использование, см. /help protect.

source: You need to select an area first.
ru: Сначала надо выбрать область.

source: /protect invoked, Owner =
ru: /protect вызван, Владелец =

source: You can't protect that area:
ru: Вы не можете защитить эту область:

source: Area protected. ID:
ru: Область защищена. ID:

source: Protect an area beetween two positions and give a player access to it without setting the parent of the area to any existing area
ru: Защитите область между двумя позициями и дайте игроку доступ к ней, не устанавливая родителя области в любую существующую область

source: Incorrect usage, see /help set_owner.
ru: Неверное использование, см. /help set_owner.

source: The player "@1" does not exist.
ru: Игрок "@1" не существует.

source: runs /set_owner. Owner =
ru: выполняется /set_owner. Владелец =

source: You have been granted control over area #@1. Type /list_areas to show your areas.
ru: Вы дали доступ на управление областью #@1. Наберите /list_areas для вывода списка своих областей.

source: Give a player access to a sub-area beetween two positions that have already been protected, Use set_owner if you don't want the parent to be set.
ru: Предоставьте игроку доступ к подзоне между двумя уже защищенными позициями. Используйте set_owner, чтобы не устанавливать из родительской области.

source: Incorrect usage, see /help add_owner
ru: Неверное использование, см. /help add_owner

source: runs /add_owner. Owner =
ru: выполняется /add_owner. Владелец =

source: You can't protect that area.
ru: Вы не можете защитить эту область.

source: Rename a area that you own
ru: Переименовать вашу область

source: Invalid usage, see /help rename_area.
ru: Неверное использование, см. /help rename_area.

source: That area doesn't exist.
ru: Такой области не существует.

source: You don't own that area.
ru: Это не ваша область.

source: Area renamed.
ru: Область переименована.

source: Find areas using a Lua regular expression
ru: Найти области с помощью регулярных выражений Lua

source: A regular expression is required.
ru: Требуется регулярное выражение.

source: Invalid regular expression.
ru: Неверное регулярное выражение.

source: No matches found.
ru: Совпадений не найдено.

source: List your areas, or all areas if you are an admin.
ru: Вывести список ваших областей или всех областей, если вы администратор.

source: No visible areas.
ru: Нет видимых областей.

source: Recursively remove areas using an id
ru: Рекурсивно удалить области используя id

source: Invalid usage, see /help recursive_remove_areas
ru: Неверное использование, см. /help recursive_remove_areas

source: Area @1 does not exist or is not owned by you.
ru: Область @1 не существует или не принадлежит вам.

source: Removed area @1 and it's sub areas.
ru: Удалена область @1 и её подзоны.

source: Remove an area using an id
ru: Удалить область используя id

source: Invalid usage, see /help remove_area
ru: Неверное использование, см. /help remove_area

source: Removed area @1
ru: Удалена область @1

source: Change the owner of an area using it's ID
ru: Изменить владельца области используя её ID

source: Invalid usage, see /help change_owner.
ru: Неверное использование, см. /help change_owner.

source: @1 has given you control over the area @2 (ID @3).
ru: @1 дал передал вам управление над областью @2 (ID @3)

source: Owner changed.
ru: Владелец изменён.

source: Toggle an area open (anyone can interact) or closed
ru: Переключить область в режим открытой (любой может взаимодействовать) или закрытой

source: Invalid usage, see /help area_open.
ru: Неверное использование, см. /help area_open.

source: closed
ru: закрыта

source: opened
ru: открыта

source: Area @1.
ru: Область @1.

source: Toggle an area open (anyone can interact farming) or closed
ru: Переключить область в режим открытой (любой может изменять местность) или закрытой

source: Invalid usage, see /help area_openfarming.
ru: Неверное использование, см. /help area_openfarming.

source: Area @1 to farming.
ru: Область @1 для добычи.

source: Move (or resize) an area to the current positions.
ru: Переместить (или изменить размер) область в текущую позицию.

source: Invalid usage, see /help move_area.
ru: Неверное использование, см. /help move_area.

source: Area does not exist.
ru: Область не существует.

source: Area successfully moved.
ru: Область перемещена.

source: Get information about area configuration and usage.
ru: Получить информацию о конфигурации и использовании области.

source: disabled
ru: отключено

source: enabled
ru: включено

source: Self protection is @1
ru: Самозащита @1

source: and you
ru: и вы

source: but you don't
ru: но вы не

source: @1 have the neccessary privilege (@2).
ru: @1 имеет соответствующие права (@2).

source: You are an area administrator ("areas" privilege).
ru: Вы администратор области (права "areas").

source: You have extended area protection limits ("areas_high_limit" privilege).
ru: У вас расширенный ограничения защиты области (права "areas_high_limit").

source: You have @1 area@2
ru: У вас @1 область@2

source: and have no area protection limits.
ru: и нет ограничений защиты области.

source: , out of a maximum of @1.
ru: , превышен @1.

source: %s spanning up to %dx%dx%d.
ru: %s охватывает до %dx%dx%d.

source: Players with the %q privilege can protect up to %d areas
ru: Игроки с правами %q могут защитить до %d областей.

source: You can protect areas
ru: Вы можете защитить области

source: Define special spawn for area
ru: Определить специальную точку порождения для области

source: Invalid usage, see /help area_addspawn.
ru: Неверное использование, см. /help area_addspawn.

source: Error, Param id must be int.
ru: Ошибка, параметр id должен быть целым числом.

source: Error, there is not such player
ru: Ошибка, не такого игрока

source: Error, there is not pos.
ru: Ошибка, это не позиция.

source: Area @1 does not exist.
ru: Область @1 не существует.

source: spawn of area @1 defined.
ru: точка порождения области @1 определена.

source: Delete special spawn of area
ru: Удалить специальную точку порождения области

source: Invalid usage, see /help area_delspawn.
ru: Неверное использование, см. /help area_delspawn.

source: spawn of area @1 deleted.
ru: точка порождения области @1 удалена.

source: No area(s)
ru: Нет области(ей)

source: %s Owner: %s %u area
ru: %s Владелец: %s %u область

source: Can administer areas.
ru: Может администрировать область.

source: Can can more, bigger areas.
ru: Может больше (количество и размер) областей.

source: Can protect areas.
ru: Может защитить области.

source: [MOD]areas loaded in @1s.
ru: [MOD]areas загружен в @1s.

source: %s is protected by %s.
ru: %s защищено %s.

source: Self protection is disabled or you do not have the necessary privilege.
ru: Самозащита отключена или у вас нет соответствующих прав.

source: Area is too big.
ru: Область слишком большая.

source: You have reached the maximum amount of areas that you are allowed to protect.
ru: Вы превысили допустимое количество областей, которые можете защитить.

source: The area intersects with %s [%u] (%s).
ru: Область пересекается с %s [%u] (%s).

source: Loads, converts, and saves the areas from a legacy save file.
ru: Загружает, конвертирует и сохраняет области в файл сохранения наследия.

source: Converting areas...
ru: Конвертация областей...

source: Error loading legacy file:
ru: Ошибка загрузки файла наследия:

source: Invalid version number. (0 allowed)
ru: Неверный номер версии. (0 разрешён)

source: Legacy file loaded.
ru: Файл наследия загружен.

source: unnamed
ru: безымянное

source: Table format updated.
ru: Формат таблицы обновлён.

source: Converted areas saved. Done.
ru: Сконвертированные области сохранены. Выполнено.

source: Select a area by id.
ru: Выбрать область по id

source: Invalid usage, see /help select_area.
ru: Неверное использование, см. /help select_area.

source: The area @1 does not exist.
ru: Область @1 не существует.

source: Area @1 selected.
ru: Область @1 выбрана.

source: Set area protection region position 1 to your location or the one specified
ru: Установить позицию 1 зоны защиты области в своё местоположение или в указанное

source: Unable to get position.
ru: Невозможно получить позицию.

source: Invalid usage, see /help area_pos1.
ru: Неверное использование, см. /help area_pos1.

source: Area position 1 set to
ru: Позиция 1 области установлена в

source: Set area protection region position 2 to your location or the one specified
ru: Установить позицию 2 зоны защиты области в своё местоположение или в указанное

source: Invalid usage, see /help area_pos2.
ru: Неверное использование, см. /help area_pos2.

source: Area position 2 set to
ru: Позиция 2 области установлена в

source: Set area protection region, position 1, or position 2 by punching nodes, or display the region
ru: Установить зону защиты области, позицию 1 или 2 ударяя узлы, или отобразить зону

source: Select positions by punching two nodes.
ru: Выберите позиции ударив два узла.

source: Select position 1 by punching a node.
ru: Выберите позицию 1 ударив узел.

source: Select position 2 by punching a node.
ru: Выберите позицию 2 ударив узел.

source: <not set>
ru: <не установлено>

source: Unknown subcommand:
ru: Неизвестная подкоманда:

source: Position 1 set to
ru: Позиция 1 установлена в

source: Position 2 set to
ru: Позиция 2 установлена в

source: Invalid setting type!
ru: Неверный тип установки!
